org/roam/software.org
:PROPERTIES:
:ID:       ed39a162-1454-4fbc-80fc-a2e9c02785a7
:END:
#+title: software
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Software
** algorithms and datastructures
- distributed
  - paxos
    - multiple roles
    - TLA+ checked
  - raft
    - single role
- hashing
  - mapembed hashing is perfect hashing that supports dynamic updates; still with O(1) lookup time
- SIEVE
  - Generalized Merge-FIFO(segcache) Queue that can outpreform LRU
    - variant ARC-SIEVE replaces ARC with own queue
- Propgators networks
  - can implement multiple problem domains with bounded eventual consistency
  - SAT, Functional Reactive Programming, Datalog, constraint programming
- Cache-oblivious lookahead array (COLA)
- Log structures merge tree
- separate compute from storage in a sans-io style
  - state machine should be driven by IO input
- 'tagless final' is a design pattern that solves the expression problem for creating DSLs
  - allows type checking interfaces at compile via an algebra (trait) of given higher kinded case class of type Algebra[Expression].
  - It decouples the interpreter from the language, making alternative implementations extensible.
  - defines how the trait can be composed with a 'final style' for host interoperability
  - solves type safe printing and parsing in compile time safe format strings
    - impl FormattingSpec for Scan and Print
- interaction networks
  - used for temporal interactions with causal chains
  - wire diagrams from inputs to outputs
  - interaction combinators
    - 3 form universal formalization by Lafont that is turing complete (erase, duplicate, annihilation)
** [[id:fd5eb707-7fc5-40ee-a550-f167f8c43635][archive-formats]]
** [[id:20556f17-762b-4534-befa-34dbd8d2ca33][bootloaders]]
** [[id:536c7bc0-8049-429d-bfe6-641eeb67399c][browsers]]
** [[id:f9cef312-d52f-4625-afbf-b94d94d6f0cc][crypto]]
** [[id:f6550312-62de-4538-8729-a11767d59560][databases]]
** [[id:7d0ec9d9-0185-4cd3-8b4a-b956c1d3aa5b][desktop]]
** [[id:aee3a8d2-a37a-454e-9359-0f56caa3502f][email]]
** [[id:7eb34c6f-cb5e-4e5d-a0c4-0139fb12d66a][file-systems]]
** [[id:40d61cd0-2c14-4a79-913c-1cefe0060c13][firewalls]]
** [[id:c9d0999f-0950-4bca-8f92-e814fe4da4c0][init-system]]
** [[id:187181c4-598e-4373-96e0-b66b5c676d23][machine-learning]]
** [[id:ff9e5548-5857-43a7-88d5-89101c2468c1][operating-systems]]
** [[id:1fd6a775-91da-4939-988f-63d30363ffc2][programming-languages]]
** Proverbs
- Murphy's law - If something can go wrong, it will.
- Goodhart's Law - When a measure becomes a target, it ceases to be a good measure
- Conway's law - Any piece of software reflects the organizational structure that produced it.
- Pareto principle - For many phenomena, 80% of consequences stem from 20% of the causes.
- Peter principle - In a hierarchy, every employee tends to rise to his level of incompetence.
- Moore's law - The power of computers per unit cost doubles every 24 month.
- Aumann's agreement theorem - There is no agreeing to disagree
- Law of Large Numbers - large results over time trend toward the average
  - ex. more code, more bugs
- Mind Projection Fallacy - when someone thinks that the way they see the world reflects the way the world really is.
- The purpose of a system is what it does. - Stafford Beer. there is "no point in claiming that the purpose of a system is to do what it constantly fails to do."
** Common
- Birthday Problem - 50% chance for 23 random people to share a birthday
- release cadence schedule sets expectations
  - large breaking changes fracture and stagnate
    - python2 to python3
    - perl 5 to perl 6
    - scala 2 to scala 3
  - incremental changes are incorporated into ecosystem over time
    - rust editions
    - jdk releases
    - c++14/17/20/23
    - objective C to swift
** Code review
- Humility should be paramount when submitting code to a location you do not *OWN*
- Code is meant to be ran by processors
  - machine semantics
    - iterator vectorization of loops (can allow simd)
    - SWAR (simd within a register)
  - stylistic clarity/future updates
    - linters/formatters
- Version control hygiene
  - messages should have a semi standardized format (like gnu changelog messages)
    - write in present tense
  - useful for developers for bug bisection and release changelog generation
** [[id:faee0cd2-0648-4539-bfc2-c8533ac755c4][service-discovery]]
** [[id:b6230d85-cd0e-4bc7-aba2-b7b068897d4f][shells]]
** [[id:92a1c0fc-707f-4d2c-86af-a55206f51c17][software-contrib]]
** [[id:6cf45163-2951-43a0-a970-25f64e785e09][software-license]]
** [[id:bed575bb-5b8c-4ecd-a078-8d501d25418c][software-metrics]]
** [[id:ab1cf09d-eedf-4134-aa33-2b7cfd1eca78][software-packaging]]
** [[id:0a94af9d-559e-4c78-b90e-cca4a43e9efe][software-projects]]
** [[id:4462b218-52ce-4445-b1ae-42ff24faf0d6][software-virt]]
** [[id:4670cd15-b5f6-42f5-ba1d-07a726aae64d][text-editors]]
** [[id:5ede22d0-93cd-4951-a2bb-3084a57ed2fc][version-control]]
** [[id:d0178e2c-9979-46db-9811-9c99bb12c121][video-encoding]]
** [[id:acec51e6-a3a8-40a0-a74e-614c2419ef01][video-games]]
** [[id:e2a56828-55c2-4b26-868c-68d4c78903ab][video-playback]]
** [[id:d3d64983-6929-4267-94b9-caf50c95dfa9][vpns]]
** [[id:167b9a3a-353c-4d7f-b706-bf7241bb6c08][webserver]]
